In [49]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [50]:
%sql sqlite:///music_smaller_10000.db

In [51]:
%%sql
SELECT COUNT(*) FROM playlists;

 * sqlite:///music_smaller_10000.db
Done.

[(8000,)]

In [52]:
%%sql
SELECT * FROM playlists ORDER BY modified_at DESC LIMIT 20;

 * sqlite:///music_smaller_10000.db
Done.

[('0-999', 20, 1509494400, 14, 9, 3, 11, 2165531, 6),
 ('0-999', 324, 1509494400, 74, 63, 3, 21, 22279115, 40),
 ('0-999', 350, 1509494400, 83, 70, 1, 5, 19787271, 40),
 ('0-999', 984, 1509494400, 203, 150, 1, 50, 48616835, 78),
 ('2000-2999', 2150, 1509494400, 104, 93, 1, 65, 23038338, 68),
 ('2000-2999', 2318, 1509494400, 236, 159, 1, 29, 54021904, 115),
 ('2000-2999', 2327, 1509494400, 142, 92, 1, 29, 31584411, 69),
 ('2000-2999', 2339, 1509494400, 183, 142, 1, 110, 51666285, 111),
 ('2000-2999', 2558, 1509494400, 67, 59, 1, 40, 16308964, 54),
 ('2000-2999', 2573, 1509494400, 37, 25, 1, 12, 8589783, 15),
 ('2000-2999', 2810, 1509494400, 40, 34, 1, 26, 8843240, 27),
 ('3000-3999', 3248, 1509494400, 141, 92, 1, 73, 30644891, 47),
 ('3000-3999', 3416, 1509494400, 31, 31, 1, 9, 7363056, 29),
 ('3000-3999', 3928, 1509494400, 40, 36, 1, 17, 9071291, 31),
 ('6000-6999', 6249, 1509494400, 73, 54, 1, 17, 15443194, 45),
 ('6000-6999', 6625, 1509494400, 24, 20, 1, 14, 5303944, 18),
 ('7000-7999', 7025, 1509494400, 111, 31, 1, 16, 19375137, 21),
 ('7000-7999', 7487, 1509494400, 168, 136, 1, 54, 36263538, 109),
 ('7000-7999', 7493, 1509494400, 78, 49, 3, 39, 17624408, 34),
 ('8000-8999', 8193, 1509494400, 106, 89, 1, 80, 25185678, 68)]

In [53]:
%%sql
SELECT title FROM songs ORDER BY duration DESC LIMIT 10;

 * sqlite:///music_smaller_10000.db
(sqlite3.OperationalError) no such table: songs
[SQL: SELECT title FROM songs ORDER BY duration DESC LIMIT 10;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [54]:
%%sql
SELECT SUM(duration) FROM songs WHERE playlist_id = <specific_playlist_id>;

 * sqlite:///music_smaller_10000.db
(sqlite3.OperationalError) near "<": syntax error
[SQL: SELECT SUM(duration) FROM songs WHERE playlist_id = <specific_playlist_id>;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [55]:
%%sql
SELECT MAX(duration) AS max_duration, MIN(duration) AS min_duration FROM songs;

 * sqlite:///music_smaller_10000.db
(sqlite3.OperationalError) no such table: songs
[SQL: SELECT MAX(duration) AS max_duration, MIN(duration) AS min_duration FROM songs;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [56]:
%%sql
SELECT COUNT(*) FROM playlists WHERE number_of_songs > 10;

 * sqlite:///music_smaller_10000.db
(sqlite3.OperationalError) no such column: number_of_songs
[SQL: SELECT COUNT(*) FROM playlists WHERE number_of_songs > 10;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [57]:
%%sql
SELECT playlist_id, COUNT(*) as song_count FROM songs GROUP BY playlist_id ORDER BY song_count DESC;

 * sqlite:///music_smaller_10000.db
(sqlite3.OperationalError) no such table: songs
[SQL: SELECT playlist_id, COUNT(*) as song_count FROM songs GROUP BY playlist_id ORDER BY song_count DESC;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [58]:
%%sql
SELECT p.playlist_id, SUM(s.duration) as total_duration
FROM playlists p
JOIN songs s ON p.playlist_id = s.playlist_id
WHERE p.playlist_id = <specific_playlist_id>
GROUP BY p.playlist_id;

 * sqlite:///music_smaller_10000.db
(sqlite3.OperationalError) near "<": syntax error
[SQL: SELECT p.playlist_id, SUM(s.duration) as total_duration
FROM playlists p
JOIN songs s ON p.playlist_id = s.playlist_id
WHERE p.playlist_id = <specific_playlist_id>
GROUP BY p.playlist_id;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [59]:
%%sql
SELECT a.artist_id, SUM(s.duration) as total_duration
FROM artists a
JOIN songs s ON a.artist_id = s.artist_id
WHERE a.artist_id = <specific_artist_id>
GROUP BY a.artist_id;

 * sqlite:///music_smaller_10000.db
(sqlite3.OperationalError) near "<": syntax error
[SQL: SELECT a.artist_id, SUM(s.duration) as total_duration
FROM artists a
JOIN songs s ON a.artist_id = s.artist_id
WHERE a.artist_id = <specific_artist_id>
GROUP BY a.artist_id;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [60]:
%%sql
SELECT p.playlist_id, COUNT(DISTINCT s.album_id) as album_count
FROM playlists p
JOIN songs s ON p.playlist_id = s.playlist_id
GROUP BY p.playlist_id
HAVING album_count > 1;

 * sqlite:///music_smaller_10000.db
(sqlite3.OperationalError) no such table: songs
[SQL: SELECT p.playlist_id, COUNT(DISTINCT s.album_id) as album_count
FROM playlists p
JOIN songs s ON p.playlist_id = s.playlist_id
GROUP BY p.playlist_id
HAVING album_count > 1;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)